<?php

namespace Database\Seeders;

use App\Models\City;
use App\Models\Region;
use Illuminate\Database\Seeder;

class CitySeeder extends Seeder
{
    public function run(): void
    {
        $cities = [

            'Республика Каракалпакстан' => [
                'Нукус',
                'Беруни',
                'Мангит',
                'Тахиаташ',
                'Турткуль',
                'Ходжейли',
                'Чимбай',
            ],

            'Андижанская область' => [
                'Андижан',
                'Асака',
                'Ханабад',
                'Карасу',
                'Шахрихан',
            ],

            'Бухарская область' => [
                'Бухара',
                'Каган',
                'Гиждуван',
                'Газли',
            ],

            'Джизакская область' => [
                'Джизак',
                'Галлаарал',
                'Даштобод',
            ],

            'Кашкадарьинская область' => [
                'Карши',
                'Шахрисабз',
                'Китаб',
                'Гузар',
                'Мубарек',
            ],

            'Навоийская область' => [
                'Навои',
                'Зарафшан',
                'Учкудук',
                'Нурота',
            ],

            'Наманганская область' => [
                'Наманган',
                'Чартак',
                'Чуст',
                'Касансай',
            ],

            'Самаркандская область' => [
                'Самарканд',
                'Каттакурган',
                'Ургут',
            ],

            'Сырдарьинская область' => [
                'Гулистан',
                'Ширин',
                'Янгиер',
            ],

            'Сурхандарьинская область' => [
                'Термез',
                'Денау',
                'Шерабад',
            ],

            'Ташкентская область' => [
                'Ангрен',
                'Алмалык',
                'Бекабад',
                'Чирчик',
                'Газалкент',
                'Паркент',
                'Янгиюль',
                'Келес',
                'Нурафшан',
                'Ташкент',
            ],

            'Ферганская область' => [
                'Фергана',
                'Коканд',
                'Маргилан',
                'Кувасай',
            ],

            'Хорезмская область' => [
                'Ургенч',
                'Хива',
                'Питнак',
            ],
        ];

        foreach ($cities as $regionName => $regionCities) {

            $region = Region::where('name', $regionName)->first();

            if (! $region) {
                continue;
            }

            foreach ($regionCities as $city) {
                City::firstOrCreate([
                    'region_id' => $region->id,
                    'name' => $city,
                ]);
            }
        }
    }
}